Revit 2027 API
FlexDuct.StartTangent Property
 Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ StartTangent { get; set; }
Public Property StartTangent As XYZ
	Get
	Set
public:
property XYZ^ StartTangent {
	XYZ^ get ();
	void set (XYZ^ value);
}
member StartTangent : XYZ with get, set
Property Value
XYZ
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
FlexDuct Class
Autodesk.Revit.DB.Mechanical Namespace